Config/Documents/РасчетНалогаНаПрибыль.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РасчетНалогаНаПрибыль</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДвиженияДокумента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДт</Name>
							<Type>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеДт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПСДт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭКДт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНалога</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыНалоговИПлатежей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НалогСборПлатеж</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НалогиИПлатежиОрганизации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Documents/РасчетНалогаНаПрибыль/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ПечатьДокумента

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.РасчетНалогаНаПрибыль";
	КомандаПечати.Идентификатор		= "РасчетНалогаНаПрибыль";
	КомандаПечати.Представление		= НСтр("ru = 'Расчет налога на прибыль'");
	КомандаПечати.Порядок			= 1;
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов - см. УправлениеПечатьюПереопределяемый.ПриПечати.МассивОбъектов
//  ПараметрыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыПечати
//  КоллекцияПечатныхФорм - см. УправлениеПечатьюПереопределяемый.ПриПечати.КоллекцияПечатныхФорм
//  ОбъектыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
//  ПараметрыВывода - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыВывода
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РасчетНалогаНаПрибыль") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"РасчетНалогаНаПрибыль",
			НСтр("ru = 'Расчет налога на прибыль'"),
			ПечатьРасчетНалогаНаПрибыль(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

Функция ПечатьРасчетНалогаНаПрибыль(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ТолькоПросмотр		= Истина;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПараметрыПечати_РасчетНалогаНаПрибыль";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РасчетНалогаНаПрибыль.ПФ_MXL_РасчетНалогаНаПрибыль");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");
	
	ДанныеДляПечати = ПолучитьДанныеДляПечати(МассивОбъектов);
	ВыборкаШапка = ДанныеДляПечати.Шапка.Выбрать();
	ВыборкаНачисления = ДанныеДляПечати.Начисления.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаШапка.Следующий() Цикл // Цикл по документам.
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбщиеСведенияПоДокументу = ДанныеДляПечати.ОбщиеСведения.Получить(ВыборкаШапка.Ссылка);
		
		// Заголовок.
		ОбластьЗаголовок.Параметры.Заполнить(ВыборкаШапка);
		ЗаполнитьЗначенияСвойств(ОбластьЗаголовок.Параметры, ОбщиеСведенияПоДокументу,
			"НаименованиеОрганизации, НаименованиеОбособленногоПодразделения, НаименованиеСтруктурногоПодразделения, СтруктурноеПодразделение,
			|Учредитель, БюджетНаименование, КодРПБС, КодРПБСОбособленногоПодразделения, ГлаваБК, ОКТМО");
		ОбластьЗаголовок.Параметры.ДатаСтрокой = Формат(ВыборкаШапка.Дата, "ДЛФ=ДД");
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		// Таблица.
		ВыборкаНачисления.Сбросить();
		ОтборСтрок = Новый Структура("Ссылка", ВыборкаШапка.Ссылка);
		Если ВыборкаНачисления.НайтиСледующий(ОтборСтрок) Тогда
			ВыборкаСтрок= ВыборкаНачисления.Выбрать();
			КоличествоСтрок = ВыборкаСтрок.Количество();
		Иначе
			КоличествоСтрок = 0;
		КонецЕсли;
		Если КоличествоСтрок > 0 Тогда
			
			ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);
			Пока ВыборкаСтрок.Следующий() Цикл
				ОбластьСтрокаТаблицы.Параметры.Заполнить(ВыборкаСтрок);
				ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
			КонецЦикла;
			ТабличныйДокумент.Вывести(ОбластьПодвалТаблицы);
			
		КонецЕсли;
		
		// Подписи.
		ДанныеГлавногоБухгалтера = Справочники.Сотрудники.ДанныеСотрудника(ВыборкаШапка.ГлавныйБухгалтер, 
			"ДолжностьНаименование,НаименованиеПолное", ВыборкаШапка.Дата);
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("ДолжностьГлБух",   ДанныеГлавногоБухгалтера.ДолжностьНаименование);
		ФИОГлБух = КорреспондентыКлиентСервер.ФИО(ДанныеГлавногоБухгалтера.НаименованиеПолное);
		ЗначенияЗаполнения.Вставить("ФИОГлБух",         ФИОГлБух);
		ЗначенияЗаполнения.Вставить("Должность",        ОбщиеСведенияПоДокументу.ОтветственныйДолжность);
		ЗначенияЗаполнения.Вставить("ФИО",              ОбщиеСведенияПоДокументу.ОтветственныйФамилияИнициалы);
		ЗначенияЗаполнения.Вставить("НомерТелефона",    ОбщиеСведенияПоДокументу.ОтветственныйТелефон);
		ЗначенияЗаполнения.Вставить("ЭлектроннаяПочта", ОбщиеСведенияПоДокументу.ОтветственныйЭлПочта);
		ОбластьПодписи.Параметры.Заполнить(ЗначенияЗаполнения);
		ОбластьПодписи.Параметры.ДатаСтрокой = Формат(ВыборкаШапка.Дата, "ДЛФ=ДД");
		ТабличныйДокумент.Вывести(ОбластьПодписи);
		
		// В табличном документе зададим имя области, в которую был выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаШапка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПолучитьДанныеДляПечати(МассивОбъектов)
	
	ТекстыЗапросов     = Новый Массив;
	ИндексыРезультатов = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	ИндексыРезультатов.Вставить("Шапка", ТекстыЗапросов.Количество());
	ТекстыЗапросов.Добавить(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетНалогаНаПрибыль.Ссылка КАК Ссылка,
	|	РасчетНалогаНаПрибыль.Номер КАК Номер,
	|	РасчетНалогаНаПрибыль.Дата КАК Дата,
	|	РасчетНалогаНаПрибыль.Организация КАК Организация,
	|	РасчетНалогаНаПрибыль.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
	|	РасчетНалогаНаПрибыль.Ответственный КАК Ответственный
	|ИЗ
	|	Документ.РасчетНалогаНаПрибыль КАК РасчетНалогаНаПрибыль
	|ГДЕ
	|	РасчетНалогаНаПрибыль.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Номер");
	
	ИндексыРезультатов.Вставить("Начисления", ТекстыЗапросов.Количество());
	ТекстыЗапросов.Добавить(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДвиженияДокумента.Ссылка КАК Ссылка,
	|	ДвиженияДокумента.НомерСтроки КАК НомерСтроки,
	|	ДвиженияДокумента.ИФО КАК ИФО,
	|	ДвиженияДокумента.КФО КАК КФО,
	|	ДвиженияДокумента.ВидНалога КАК ВидНалога,
	|	ДвиженияДокумента.НалогСборПлатеж КАК НалогСборПлатеж,
	|	ДвиженияДокумента.СчетДт КАК СчетДебета,
	|	ДвиженияДокумента.ПодразделениеДт КАК Подразделение,
	|	ДвиженияДокумента.КПСДт КАК КБК,
	|	ДвиженияДокумента.КЭКДт КАК КОСГУ,
	|	ДвиженияДокумента.Сумма КАК Сумма
	|ИЗ
	|	Документ.РасчетНалогаНаПрибыль.ДвиженияДокумента КАК ДвиженияДокумента
	|ГДЕ
	|	ДвиженияДокумента.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	Ссылка");
	
	Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Результаты = Запрос.ВыполнитьПакет();
	
	ДанныеДляПечати = Новый Структура;
	ДанныеДляПечати.Вставить("Шапка", Результаты[ИндексыРезультатов.Шапка]);
	ДанныеДляПечати.Вставить("Начисления", Результаты[ИндексыРезультатов.Начисления]);
	
	// Добавим общие сведения для печати.
	ДанныеДляПечати.Вставить("ОбщиеСведения", 
		УправлениеПечатьюБГУ.ОбщиеСведенияДокументовДляПечати(МассивОбъектов));
	
	Возврат ДанныеДляПечати;
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеДокумента

Функция НалогСборПлатежПоУмолчанию(Организация, ВидНалога) Экспорт

	Возврат Справочники.НалогиИПлатежиОрганизации.НалогСборПлатежПоУмолчанию(Организация, ВидНалога); 
	
КонецФункции

#КонецОбласти

#КонецЕсли
